/*
 * #1
 * С помощью деструктуризации массивов, выведите в консоль нужные значения
 */

{
  let array = [1, 2, 3, 4, 5]

  console.log(a) // 1
  console.log(b) // 2
}

/*
 * #2
 * С помощью деструктуризации массивов, выведите в консоль нужные значения
 */

{
  let array = [1, 2, 3, 4, 5]

  console.log(c) // 3
}

/*
 * #3
 * С помощью spread оператора и деструктуризации массивов, выведите в консоль нужные значения
 */

{
  let array = [1, 2, 3, 4, 5]

  console.log(x) // 1
  console.log(rest) // [2, 3, 4, 5]
}

/*
 * #4
 * С помощью деструктуризации объектов, выведите в консоль нужные значения
 */

{
  let me = {
    name: 'User',
    age: 21,
    gender: 'male',
    city: 'Kharkiv',
  }

  console.log(firstName) // User
  console.log(city) // Kharkiv
}
